using System;

/*

    Pапрограмуйте клас Money (об'єкт класу оперує однією валютою) для роботи з грошима. 

    У класі мають бути передбачені: поле для зберігання цілої частини грошей (долари, євро, гривні тощо) і поле для зберігання копійок (центи, євроценти, копійки тощо) 

    Реалізувати методи виведення суми на екран, задання значень частин 

    (цілої частини грошей та копійок). 

    На базі класу Money створити клас Product для роботи з продуктом або товаром. 

    Реалізувати метод, який дозволяє зменшити ціну на задане число. 

    Для кожного з класів реалізувати необхідні методи і поля. 

    Додати iнкапсуляцiю до полiв та методiв якщо треба.

 */


namespace HW_002
{
    public class Program
    {
        static void Main()
        {
            Money mon = new Money(8,10);
            Product prod = new Product("Bread", mon);
            prod.Show();

            Console.WriteLine("Changed price: ");
            mon = new Money(2, 90);
            prod.ChangePrice(mon);
            prod.Show();
        }

    }
}
