using System;

/*
 
        Завдання 3 

        Створіть інтерфейс ISort. 

        У ньому мають бути три методи: 

        ■ void SortAsc() — сортування за зростанням; 

        ■ void SortDesc() — сортування за зменшенням; 

        ■ void SortByParam(bool isAsc) — сортування залежно від переданого параметра. 

        Якщо isAsc дорівнює true, сортуємо за зростанням. 

        Якщо isAsc дорівнює false, сортуємо за зменшенням

        Клас, створений у першому завданні Array, має імплементувати інтерфейс ISort. 

        Метод SortAsc — сортує масив за зростанням. 

        Метод SortDesc — сортує масив за спаданням. 

        Спосіб SortByParam — сортує масив залежно від переданого параметра. 

        Якщо isAsc дорівнює true, сортуємо за зростанням. 

        Якщо isAsc дорівнює false, сортуємо за зменшенням. 

        Напишіть код для тестування отриманої функціональності.
 
 */

namespace HW_003_3
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
